Информационная_база/Documents/НазначениеОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеОпросов</Name>
			<BasedOn>
				<xr:Item>Catalog.ШаблоныБинарныхДеревьев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныБинарныхДеревьев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеспондентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экзамен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныйОпрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВАрхивеАнкет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьПредварительногоСохранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Информационная_база/Documents/НазначениеОпросов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Поместить в Модуль Объекта документа "НазначениеОпросов"

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШаблоныБинарныхДеревьев") Тогда
		// Заполнение шапки
		Наименование = ДанныеЗаполнения.Наименование;
		ШаблонТеста = ДанныеЗаполнения.Ссылка;
		СвободныйОпрос = Истина;
		ПоказыватьВАрхивеАнкет = Ложь;
		ДатаНачала = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Поместить в Модуль Объекта документа "НазначениеОпросов"

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ШаблонТеста) Тогда
		Сообщить("Не указан шаблон теста!"); Отказ = Истина; Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Респонденты.Количество() = 0 Тогда
		Сообщить("Не указан ни один респондент!"); Отказ = Истина; Возврат;
	КонецЕсли;

	Для Каждого СтрокаРеспондента Из ЭтотОбъект.Респонденты Цикл
		
		// --- НОВАЯ УЛУЧШЕННАЯ ЛОГИКА ---
		
		// 1. Создаем объект документа
		НовыйТест = Документы.ТестБинарноеДерево.СоздатьДокумент();
		
		// 2. Явно и надежно заполняем все необходимые реквизиты ДО записи
		НовыйТест.Опрос = ЭтотОбъект.Ссылка;
		НовыйТест.ШаблонТеста = ЭтотОбъект.ШаблонТеста;
		НовыйТест.Респондент = СтрокаРеспондента.Респондент;
		НовыйТест.Дата = ТекущаяДата();
		
		// 3. Вызываем ОбработкуЗаполнения, чтобы подтянулась структура дерева и прочая логика
		НовыйТест.ОбработкаЗаполнения(ЭтотОбъект.Ссылка);
		
		// 4. Записываем полностью готовый документ
		Попытка
			НовыйТест.Записать(РежимЗаписиДокумента.Запись); // Просто записываем, не проводим
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось создать тест для респондента '" + СтрокаРеспондента.Респондент 
			                + "'. Ошибка: " + ОписаниеОшибки();
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
